dict = {1:'зима',
        2: 'зима',
        12:'зима',
        3:'весна',
        4:'весна',
        5:'весна',
        6:'лето',
        7:'лето',
        8:'лето',
        9:'осень',
        10:'осень',
        11:'осень'}
n = int(input('Введите номер месяца: '))
print('Первый способ решения через словарь, используя метод get(): ', dict.get(n))
vremya_goda = ('зима', 'весна', 'лето', 'осень')
text = 'Второй способ решения через список: '
if (1<=n<=2) or n == 12:
        print(text,vremya_goda[0])
elif 3<=n<=5:
        print(text,vremya_goda[1])
elif 6 <= n <= 8:
        print(text,vremya_goda[2])
else:
        print(text,vremya_goda[3])